'''
某民意調查機構針對A、B、C、D四個政黨的偏愛做調查。
過去的資料顯示民眾對A、B、C、D政黨的喜愛程度分別為 PA=0.4、PB=0.4、PC=0.05、PD=0.15。
現在該民調機構隨機選出2000個選民,其中A、B、C、D政黨的偏愛選民人數分別為 865、754、124、257人
試於alpha = 0.01之下,檢定選民的偏好是否有改變
'''
from scipy import stats

# H0:PA=0.4、PB=0.4、PC=0.05、PD=0.15 Ha:H0不成立

# 觀察值 =>865、754、124、257
# 理論值 =>2000*0.4、2000*0.4、2000*0.05、2000*0.15

###############################################################################臨界值檢定###############################################################################
alpha=0.01
v = 4-1 
chi_test_stastic=(865-2000*0.4)**2/(2000*0.4) + (754-2000*0.4)**2/(2000*0.4) + (124-2000*0.05)**2/(2000*0.05) + (257-2000*0.15)**2/(2000*0.15)
right_limit = stats.chi2.ppf(1-alpha,df=v)
print(right_limit)
print(f'卡方檢定一律為右尾檢定。 因為卡方統計量{chi_test_stastic} 大於臨界值 {right_limit} ,故拒絕H0,就是選民的偏好有改變')

###############################################################################p-value檢定###############################################################################
alpha=0.01
v = 4-1
chi_test_stastic=(865-2000*0.4)**2/(2000*0.4) + (754-2000*0.4)**2/(2000*0.4) + (124-2000*0.05)**2/(2000*0.05) + (257-2000*0.15)**2/(2000*0.15)
p_value = 1-stats.chi2.cdf(chi_test_stastic,df =v )
print(f'卡方檢定一律為右尾檢定。 因為p-value {p_value} 小於alpha {alpha} ,故拒絕H0,就是選民的偏好有改變')


